# Essentials
brew 'zsh'
brew 'git'
brew 'neovim'
brew 'tmux'
brew 'fzf'
brew 'coreutils'
brew 'curl'
brew 'bash'
brew 'tig'
brew 'findutils'
brew 'gnu-sed'
brew 'jq'
brew 'ripgrep'
brew 'grep'
brew 'readline'
brew 'openssl'
brew 'gh'

# 2nd tier

#brew 'vim', args: ['with-lua', 'override-system-vi']
brew 'git-extras'
brew 'gpg'
# brew 'gpg-agent'
# brew 'moreutils' # conflicts with gnu parallel
brew 'gnu-indent' #, args: ['with-default-names']
brew 'gnu-tar' #, args: ['with-default-names']
brew 'gnu-which' #, args: ['with-default-names']
brew 'htop'
brew 'tmux-mem-cpu-load'
brew 'shellcheck'
brew 'ncdu'
brew 'wget'
brew 'rsync'
brew 'ctags'
brew 'nmap'
brew 'xz'
brew 'zlib'
brew 'gzip'
brew 'pstree'
brew 'tree'
brew 'the_silver_searcher'
brew 'watch'

# Coding
brew 'asdf'  # https://asdf-vm.com/#/core-manage-asdf?
brew 'docker'
brew 'docker-compose'
brew 'sqlite3'
brew 'pgcli'
brew 'postgresql'
brew 'libyaml'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'pipenv'
brew 'maven'
brew 'scala'
brew 'sbt'
brew 'cookiecutter'
brew 'node'
brew 'yarn'
brew 'pandoc'
#brew 'ruby-build'

brew 'encfs'
brew 'borgbackup'

tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'


#cask 'google-chrome'
cask 'keepassxc'
cask 'kitty'
cask 'alacritty'
cask 'google-backup-and-sync'
cask 'karabiner-elements'
cask 'hammerspoon'
#cask 'slack'
cask 'corretto11'
cask 'corretto8'
cask 'dropbox'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'osxfuse'
cask 'libreoffice'
# cask 'spotify'
cask 'gnucash'
cask 'google-cloud-sdk'
cask 'intellij-idea-ce'
cask 'firefox'
cask 'betterzip'
cask 'docker'

cask 'keeweb'
cask 'iterm2'
cask 'google-hangouts'
cask 'zoom'
brew 'ntfs-3g'
cask 'caffeine'

# quick look
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlimagesize'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'epubquicklook'

cask 'vlc'
cask 'the-unarchiver'
# cask 'virtualbox'
# cask 'synergy'
cask 'atom'
#cask 'keepassx'
#cask 'macvim'
#cask 'font-source-code-pro'


# extras
brew 'fswatch'
brew 'bind'
brew 'httpie'
brew 'p7zip'
brew 'pigz'
brew 'zstd'
brew 'unrar'
brew 'bfg'  # like git-filter-branch
brew 'bat'
brew 'prettyping'
brew 'entr'
brew 'lnav'
brew 'bash-completion'
brew 'hyperfine'

brew 'fd'
brew 'getmail'
brew 'mas'  # mac app store interface
# brew 'reattach-to-user-namespace'  # not needed? https://github.com/ChrisJohnsen/tmux-MacOSX-pasteboard/issues/66
brew 'emacs'
brew 'peco'
brew 'ack'
brew 'bats'
brew 'foremost'  # recover files based
brew 'fasd'
brew 'hashpump'
brew 'lynx'
brew 'pv'  # Monitor data's progress through a pipe
brew 'rename'
brew 'xsv'
brew 'exa'
# brew 'tavianator/tap/bfs'
# brew 'duplicity'
# brew 'duply'
brew 'sshuttle'
#brew 'ledger'
brew 'youtube-dl'
brew 'ansifilter'
