tap 'homebrew/dupes'
tap 'homebrew/versions'
brew 'zsh'
brew 'git'
brew 'tig'
brew 'vim', args: ['with-lua', 'override-system-vi']
brew 'neovim/neovim/neovim'
brew 'emacs'
brew 'shellcheck'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'tmux-mem-cpu-load'
brew 'fzf'
brew 'peco'
brew 'coreutils'
brew 'gnu-sed', args: ['with-default-names']
brew 'gnu-indent', args: ['with-default-names']
brew 'gnu-tar', args: ['with-default-names']
brew 'gnu-which', args: ['with-default-names']
brew 'findutils', args: ['with-default-names']
brew 'moreutils'
brew 'ack'
brew 'curl', args: ['with-openssl']
brew 'bfg'
brew 'bats'
brew 'ctags'
brew 'foremost'
brew 'fasd'
brew 'hashpump'
brew 'lynx'
brew 'nmap'
brew 'gzip'
brew 'p7zip'
brew 'pigz'
brew 'unrar'
brew 'pv'
brew 'rename'
brew 'the_silver_searcher'
brew 'tree'
brew 'wget', args: ['enable-iri']
brew 'jq'
brew 'watch'
brew 'fswatch'
brew 'rsync'
brew 'duplicity'
brew 'duply'
brew 'gpg'
brew 'gpg-agent'
brew 'sshuttle'
brew 'bind'
brew 'bash'
brew 'bash-completion'
brew 'openssl'
brew 'ruby-build'
brew 'rbenv'
brew 'libyaml'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'cookiecutter'
brew 'node'
brew 'maven'
brew 'scala'
brew 'sbt'
brew 'lua'
brew 'docker'
brew 'docker-machine'
brew 'docker-compose'
brew 'ncdu'
brew 'ledger'
brew 'youtube-dl'
brew 'lastpass-cli'
brew 'getmail'
brew 'pgcli'
brew 'sqlite'
brew 'ansifilter'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
cask 'karabiner'
cask 'seil'
cask 'iterm2'
cask 'google-chrome'
cask 'java'
cask 'dropbox'
cask 'libreoffice'
cask 'keepassx'
cask 'keeweb'
cask 'macvim'
cask 'slack'
cask 'font-source-code-pro'
cask 'spotify'
cask 'gnucash'
cask 'betterzip'
cask 'the-unarchiver'
cask 'screenhero'
cask 'synergy'
cask 'google-drive'
cask 'firefox'
cask 'vlc'
cask 'virtualbox'
cask 'hammerspoon'
cask 'google-hangouts'
cask 'google-photos-backup'
cask 'atom'
cask 'osxfuse'
cask 'borgbackup'
cask 'google-cloud-sdk'
cask 'intellij-idea-ce'
brew 'homebrew/fuse/encfs'
brew 'ntfs-3g'
