tap 'homebrew/dupes'
tap 'homebrew/versions'
brew 'zsh'
brew 'git'
brew 'git-extras'
brew 'tig'
brew 'neovim'
brew 'vim', args: ['with-lua', 'override-system-vi']
brew 'tmux'
brew 'fzf'
brew 'coreutils'
brew 'curl', args: ['with-openssl']
brew 'bash'
brew 'bash-completion'

# 2nd tier

brew 'jq'
brew 'gpg'
# brew 'gpg-agent'
brew 'moreutils'
brew 'findutils', args: ['with-default-names']
brew 'gnu-sed', args: ['with-default-names']
brew 'gnu-indent', args: ['with-default-names']
brew 'gnu-tar', args: ['with-default-names']
brew 'gnu-which', args: ['with-default-names']
brew 'htop'
brew 'tmux-mem-cpu-load'
brew 'shellcheck'
brew 'wget', args: ['enable-iri']
brew 'ctags'
brew 'nmap'
brew 'gzip'
brew 'p7zip'
brew 'pigz'
brew 'unrar'
brew 'pstree'
brew 'tree'
brew 'the_silver_searcher'
brew 'ripgrep'
brew 'watch'
brew 'fswatch'
brew 'rsync'
brew 'httpie'
brew 'bind'
brew 'openssl'
brew 'ncdu'
brew 'bfg'  # like git-filter-branch

# Coding
brew 'sqlite'
brew 'pgcli'
brew 'postgresql'
brew 'libyaml'
brew 'python'
brew 'python3'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'cookiecutter'
brew 'ruby-build'
brew 'rbenv'
brew 'node'
brew 'maven'
brew 'scala'
brew 'sbt'
brew 'docker'
brew 'docker-machine'
brew 'docker-compose'
brew 'lua'

# extras

brew 'getmail'
brew 'mas'  # mac app store interface
# brew 'reattach-to-user-namespace'  # not needed? https://github.com/ChrisJohnsen/tmux-MacOSX-pasteboard/issues/66
brew 'emacs'
brew 'peco'
brew 'ack'
brew 'bats'
brew 'foremost'  # recover files based
brew 'fasd'
brew 'hashpump'
brew 'lynx'
brew 'pv'  # Monitor data's progress through a pipe
brew 'rename'
brew 'fd'
brew 'xsv'
brew 'exa'
# brew 'tavianator/tap/bfs'
brew 'duplicity'
brew 'duply'
brew 'sshuttle'
brew 'ledger'
brew 'youtube-dl'
brew 'ansifilter'


tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'

cask 'google-chrome'
cask 'keeweb'
cask 'iterm2'
cask 'google-backup-and-sync'
# cask 'karabiner'
cask 'karabiner-elements'
cask 'hammerspoon'
cask 'java'
cask 'dropbox'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'osxfuse'
cask 'borgbackup'
brew 'encfs'
cask 'libreoffice'
cask 'slack'
cask 'spotify'
cask 'gnucash'
cask 'google-cloud-sdk'
cask 'firefox'
cask 'google-hangouts'
cask 'google-cloud-sdk'
cask 'intellij-idea-ce'
brew 'ntfs-3g'
cask 'caffeine'
cask 'betterzip'

# quick look
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlimagesize'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'epubquicklook'

cask 'vlc'
cask 'the-unarchiver'
# cask 'virtualbox'
# cask 'synergy'
cask 'atom'
cask 'keepassx'
cask 'macvim'
cask 'font-source-code-pro'
